RT-Thread/rt-thread/bsp/stm32/libraries/STM32U5xx_HAL/STM32U5xx_HAL_Driver/Src/stm32u5xx_ll_adc.c
#define IS_LL_ADC_INJ_SEQ_SCAN_DISCONT_MODE(__INJ_SEQ_DISCONT_MODE__)           \
  (   ((__INJ_SEQ_DISCONT_MODE__) == LL_ADC_INJ_SEQ_DISCONT_DISABLE)            \
      || ((__INJ_SEQ_DISCONT_MODE__) == LL_ADC_INJ_SEQ_DISCONT_1RANK)           \
  )

/**
  * @}
  */


/* Private function prototypes -----------------------------------------------*/

/* Exported functions --------------------------------------------------------*/
/** @addtogroup ADC_LL_Exported_Functions
  * @{
  */

/** @addtogroup ADC_LL_EF_Init
  * @{
  */
/**
  * @brief  De-initialize registers of all ADC instances belonging to
  *         the same ADC common instance to their default reset values.
  * @note   This function is performing a hard reset, using high level
  *         clock source RCC ADC reset.
  *         Caution: On this STM32 series, if several ADC instances are available
  *         on the selected device, RCC ADC reset will reset
  *         all ADC instances belonging to the common ADC instance.
  *         To de-initialize only 1 ADC instance, use
  *         function @ref LL_ADC_DeInit().
  * @param  pADCxyCOMMON ADC common instance
  *         (can be set directly from CMSIS definition or by using helper macro @ref __LL_ADC_COMMON_INSTANCE() )
  * @retval An ErrorStatus enumeration value:
  *          - SUCCESS: ADC common registers are de-initialized
  *          - ERROR: not applicable
  */
ErrorStatus LL_ADC_CommonDeInit(ADC_Common_TypeDef *pADCxyCOMMON)
{
  /* Check the parameters */
  assert_param(IS_ADC_COMMON_INSTANCE(pADCxyCOMMON));

  if (pADCxyCOMMON == ADC12_COMMON)
  {
    /* Force reset of ADC clock (core clock) */
    LL_AHB2_GRP1_ForceReset(LL_AHB2_GRP1_PERIPH_ADC1);

    /* Release reset of ADC clock (core clock) */
    LL_AHB2_GRP1_ReleaseReset(LL_AHB2_GRP1_PERIPH_ADC1);
  }
  else   /*if ( pADCxyCOMMON == ADC4_COMMON)*/
  {
    /* Force reset of ADC clock (core clock) */
    LL_AHB3_GRP1_ForceReset(LL_AHB3_GRP1_PERIPH_ADC4);

    /* Release reset of ADC clock (core clock) */
    LL_AHB3_GRP1_ReleaseReset(LL_AHB3_GRP1_PERIPH_ADC4);
  }

  return SUCCESS;
}

/**
  * @brief  Initialize some features of ADC common parameters
  *         (all ADC instances belonging to the same ADC common instance)
  *         and multimode (for devices with several ADC instances available).
  * @note   The setting of ADC common parameters is conditioned to
  *         ADC instances state:
  *         All ADC instances belonging to the same ADC common instance
  *         must be disabled.
  * @param  pADCxyCOMMON ADC common instance
  *         (can be set directly from CMSIS definition or by using helper macro @ref __LL_ADC_COMMON_INSTANCE() )
  * @param  pADC_CommonInit Pointer to a @ref LL_ADC_CommonInitTypeDef structure
  * @retval An ErrorStatus enumeration value:
  *          - SUCCESS: ADC common registers are initialized
  *          - ERROR: ADC common registers are not initialized
  */
ErrorStatus LL_ADC_CommonInit(ADC_Common_TypeDef *pADCxyCOMMON, LL_ADC_CommonInitTypeDef *pADC_CommonInit)
{
  ErrorStatus status = SUCCESS;

  /* Check the parameters */
  assert_param(IS_ADC_COMMON_INSTANCE(pADCxyCOMMON));
  assert_param(IS_LL_ADC_CLOCK(pADC_CommonInit->CommonClock));

  /* Note: Hardware constraint (refer to description of functions             */
  /*       "LL_ADC_SetCommonXXX()" and "LL_ADC_SetMultiXXX()"):               */
  /*       On this STM32 series, setting of these features is conditioned to   */
  /*       ADC state:                                                         */
  /*       All ADC instances of the ADC common group must be disabled.        */
  if (__LL_ADC_IS_ENABLED_ALL_COMMON_INSTANCE(pADCxyCOMMON) == 0UL)
  {
    /* Configuration of ADC hierarchical scope:                               */
    /*  - common to several ADC                                               */
    /*    (all ADC instances belonging to the same ADC common instance)       */
    /*    - Set ADC clock (conversion clock)                                  */
    LL_ADC_SetCommonClock(pADCxyCOMMON, pADC_CommonInit->CommonClock);
  }
  else
  {
    /* Initialization error: One or several ADC instances belonging to        */
    /* the same ADC common instance are not disabled.                         */
    status = ERROR;
  }

  return status;
}

/**
  * @brief  Set each @ref LL_ADC_CommonInitTypeDef field to default value.
  * @param  pADC_CommonInit Pointer to a @ref LL_ADC_CommonInitTypeDef structure
  *                              whose fields will be set to default values.
  * @retval None
  */
void LL_ADC_CommonStructInit(LL_ADC_CommonInitTypeDef *pADC_CommonInit)
{
  /* Set pADC_CommonInit fields to default values */
  /* Set fields of ADC common */
  /* (all ADC instances belonging to the same ADC common instance) */
  pADC_CommonInit->CommonClock = LL_ADC_CLOCK_ASYNC_DIV2;

}

/**
  * @brief  De-initialize registers of the selected ADC instance
  *         to their default reset values.
  * @note   To reset all ADC instances quickly (perform a hard reset),
  *         use function @ref LL_ADC_CommonDeInit().
  * @param  pADCx ADC instance
  * @retval An ErrorStatus enumeration value:
  *          - SUCCESS: ADC registers are de-initialized
  *          - ERROR: ADC registers are not de-initialized
  */
ErrorStatus LL_ADC_DeInit(ADC_TypeDef *pADCx)
{
  ErrorStatus status = SUCCESS;
  __IO uint32_t timeout_cpu_cycles = 0UL;

  /* Check the parameters */
  assert_param(IS_ADC_ALL_INSTANCE(pADCx));

  /* Disable ADC instance if not already disabled.                            */
  if (LL_ADC_IsEnabled(pADCx) == 1UL)
  {
    /* Set ADC group regular trigger source to SW start to ensure to not      */
    /* have an external trigger event occurring during the conversion stop    */
    /* ADC disable process.                                                   */
    LL_ADC_REG_SetTriggerSource(pADCx, LL_ADC_REG_TRIG_SOFTWARE);

    /* Stop potential ADC conversion on going on ADC group regular.           */
    if (LL_ADC_REG_IsConversionOngoing(pADCx) != 0UL)
    {
      if (LL_ADC_REG_IsStopConversionOngoing(pADCx) == 0UL)
      {
        LL_ADC_REG_StopConversion(pADCx);
      }
    }

    /* Wait for ADC conversions are effectively stopped                       */
    timeout_cpu_cycles = ADC_TIMEOUT_STOP_CONVERSION_CPU_CYCLES;
    if (pADCx != ADC4)  /* ADC1 or ADC2 */
    {
      while ((LL_ADC_REG_IsStopConversionOngoing(pADCx)
              | LL_ADC_INJ_IsStopConversionOngoing(pADCx)) == 1UL)
      {
        timeout_cpu_cycles--;
        if (timeout_cpu_cycles == 0UL)
        {
          /* Time-out error */
          status = ERROR;
          break;
        }
      }
    }
    else
    {
      while (LL_ADC_REG_IsStopConversionOngoing(pADCx) == 1UL)
      {
        timeout_cpu_cycles--;
        if (timeout_cpu_cycles == 0UL)
        {
          /* Time-out error */
          status = ERROR;
        }
      }
    }
    /* Disable the ADC instance */
    LL_ADC_Disable(pADCx);

    /* Wait for ADC instance is effectively disabled */
    timeout_cpu_cycles = ADC_TIMEOUT_DISABLE_CPU_CYCLES;
    while (LL_ADC_IsDisableOngoing(pADCx) == 1UL)
    {
      timeout_cpu_cycles--;
      if (timeout_cpu_cycles == 0UL)
      {
        /* Time-out error */
        status = ERROR;
      }
    }
  }

  if (pADCx != ADC4) /* ADC1 or ADC2 */
  {
    CLEAR_BIT(pADCx->IER,
              (LL_ADC_IT_AWD3
               | LL_ADC_IT_AWD2
               | LL_ADC_IT_AWD1
               | LL_ADC_IT_JQOVF
               | LL_ADC_IT_OVR
               | LL_ADC_IT_JEOS
               | LL_ADC_IT_JEOC
               | LL_ADC_IT_EOS
               | LL_ADC_IT_EOC
               | LL_ADC_IT_EOSMP
               | LL_ADC_IT_ADRDY
              )
             );

    /* Reset register ISR */
    SET_BIT(pADCx->ISR,
            (LL_ADC_FLAG_AWD3
             | LL_ADC_FLAG_AWD2
             | LL_ADC_FLAG_AWD1
             | LL_ADC_FLAG_JQOVF
             | LL_ADC_FLAG_OVR
             | LL_ADC_FLAG_JEOS
             | LL_ADC_FLAG_JEOC
             | LL_ADC_FLAG_EOS
             | LL_ADC_FLAG_EOC
             | LL_ADC_FLAG_EOSMP
             | LL_ADC_FLAG_ADRDY
            )
           );

    /* Reset register CR */
    /* Bits ADC_CR_ADCAL, ADC_CR_ADSTP, ADC_CR_ADSTART are in access mode     */
    /* "read-set": no direct reset applicable.                                */
    CLEAR_BIT(pADCx->CR, ADC_CR_ADVREGEN);
    SET_BIT(pADCx->CR, ADC_CR_DEEPPWD);

