RT-Thread/rt-thread/bsp/stm32/libraries/STM32U5xx_HAL/STM32U5xx_HAL_Driver/Src/stm32u5xx_ll_adc.c
  /* Note: Hardware constraint (refer to description of this function):       */
  /*       ADC instance must be disabled.                                     */
  if (LL_ADC_IsEnabled(pADCx) == 0UL)
  {
    /* Configuration of ADC hierarchical scope:                               */
    /*  - ADC group regular                                                   */
    /*    - Set ADC group regular trigger source                              */
    /*    - Set ADC group regular sequencer length                            */
    /*    - Set ADC group regular sequencer discontinuous mode                */
    /*    - Set ADC group regular continuous mode                             */
    /*    - Set ADC group regular conversion data transfer: no transfer or    */
    /*      transfer by DMA, and DMA requests mode                            */
    /*    - Set ADC group regular overrun behavior                            */
    /* Note: On this STM32 series, ADC trigger edge is set when starting       */
    /*       ADC conversion.                                                  */
    /*       Refer to function @ref LL_ADC_REG_StartConversionExtTrig().      */
    if (pADCx != ADC4)  /* ADC1 or ADC2 */
    {
      if (pADC_RegInitStruct->SequencerLength != LL_ADC_REG_SEQ_SCAN_DISABLE)
      {
        MODIFY_REG(pADCx->CFGR1,
                   ADC_CFGR1_EXTSEL
                   | ADC_CFGR1_EXTEN
                   | ADC_CFGR1_DISCEN
                   | ADC_CFGR1_DISCNUM
                   | ADC_CFGR1_CONT
                   | ADC_CFGR1_DMNGT
                   | ADC_CFGR1_OVRMOD
                   ,
                   pADC_RegInitStruct->TriggerSource
                   | pADC_RegInitStruct->SequencerDiscont
                   | pADC_RegInitStruct->ContinuousMode
                   | pADC_RegInitStruct->DataTransferMode
                   | pADC_RegInitStruct->Overrun
                  );
      }
      else
      {
        MODIFY_REG(pADCx->CFGR1,
                   ADC_CFGR1_EXTSEL
                   | ADC_CFGR1_EXTEN
                   | ADC_CFGR1_DISCEN
                   | ADC_CFGR1_DISCNUM
                   | ADC_CFGR1_CONT
                   | ADC_CFGR1_DMNGT
                   | ADC_CFGR1_OVRMOD
                   ,
                   pADC_RegInitStruct->TriggerSource
                   | LL_ADC_REG_SEQ_DISCONT_DISABLE
                   | pADC_RegInitStruct->ContinuousMode
                   | pADC_RegInitStruct->DataTransferMode
                   | pADC_RegInitStruct->Overrun
                  );
      }
    }
    else
    {
      if ((LL_ADC_REG_GetSequencerConfigurable(pADCx) == LL_ADC_REG_SEQ_FIXED)
          || (pADC_RegInitStruct->SequencerLength != LL_ADC_REG_SEQ_SCAN_DISABLE)
         )
      {
        MODIFY_REG(pADCx->CFGR1,
                   ADC_CFGR1_EXTSEL
                   | ADC_CFGR1_EXTEN
                   | ADC_CFGR1_DISCEN
                   | ADC_CFGR1_CONT
                   | ADC4_CFGR1_DMAEN
                   | ADC4_CFGR1_DMACFG
                   | ADC_CFGR1_OVRMOD
                   ,
                   pADC_RegInitStruct->TriggerSource
                   | pADC_RegInitStruct->SequencerDiscont
                   | pADC_RegInitStruct->ContinuousMode
                   | pADC_RegInitStruct->DMATransfer
                   | pADC_RegInitStruct->Overrun
                  );
      }
      else
      {
        MODIFY_REG(pADCx->CFGR1,
                   ADC_CFGR1_EXTSEL
                   | ADC_CFGR1_EXTEN
                   | ADC_CFGR1_DISCEN
                   | ADC_CFGR1_CONT
                   | ADC4_CFGR1_DMAEN
                   | ADC4_CFGR1_DMACFG
                   | ADC_CFGR1_OVRMOD
                   ,
                   pADC_RegInitStruct->TriggerSource
                   | LL_ADC_REG_SEQ_DISCONT_DISABLE
                   | pADC_RegInitStruct->ContinuousMode
                   | pADC_RegInitStruct->DMATransfer
                   | pADC_RegInitStruct->Overrun
                  );
      }
    }

    /* Set ADC group regular sequencer length and scan direction */
    if (pADCx == ADC4)
    {
      if (LL_ADC_REG_GetSequencerConfigurable(pADCx) != LL_ADC_REG_SEQ_FIXED)
      {
        LL_ADC_REG_SetSequencerLength(pADCx, pADC_RegInitStruct->SequencerLength);
      }
    }
    else
    {
      LL_ADC_REG_SetSequencerLength(pADCx, pADC_RegInitStruct->SequencerLength);
    }
  }
  else
  {
    /* Initialization error: ADC instance is not disabled. */
    status = ERROR;
  }
  return status;
}

/**
  * @brief  Set each @ref LL_ADC_REG_InitTypeDef field to default value.
  * @param  pADCx ADC instance
  * @param  pADC_RegInitStruct Pointer to a @ref LL_ADC_REG_InitTypeDef structure
  *                            whose fields will be set to default values.
  * @retval None
  */
void LL_ADC_REG_StructInit(ADC_TypeDef *pADCx, LL_ADC_REG_InitTypeDef *pADC_RegInitStruct)
{
  /* Set pADC_RegInitStruct fields to default values */
  /* Set fields of ADC group regular */
  /* Note: On this STM32 series, ADC trigger edge is set when starting         */
  /*       ADC conversion.                                                    */
  /*       Refer to function @ref LL_ADC_REG_StartConversionExtTrig().        */
  pADC_RegInitStruct->TriggerSource    = LL_ADC_REG_TRIG_SOFTWARE;
  pADC_RegInitStruct->SequencerLength  = LL_ADC_REG_SEQ_SCAN_DISABLE;
  pADC_RegInitStruct->SequencerDiscont = LL_ADC_REG_SEQ_DISCONT_DISABLE;
  pADC_RegInitStruct->ContinuousMode   = LL_ADC_REG_CONV_SINGLE;
  pADC_RegInitStruct->Overrun          = LL_ADC_REG_OVR_DATA_OVERWRITTEN;
  if (pADCx != ADC4) /* ADC1 or ADC2 */
  {
    pADC_RegInitStruct->DataTransferMode = LL_ADC_REG_DR_TRANSFER;
  }
  else
  {
    pADC_RegInitStruct->DMATransfer      = LL_ADC_REG_DMA_TRANSFER_NONE_ADC4;
  }
}

/**
  * @brief  Initialize some features of ADC group injected.
  * @note   These parameters have an impact on ADC scope: ADC group injected.
  *         Refer to corresponding unitary functions into
  *         @ref ADC_LL_EF_Configuration_ADC_Group_Regular
  *         (functions with prefix "INJ").
  * @note   The setting of these parameters by function @ref LL_ADC_Init()
  *         is conditioned to ADC state:
  *         ADC instance must be disabled.
  *         This condition is applied to all ADC features, for efficiency
  *         and compatibility over all STM32 families. However, the different
  *         features can be set under different ADC state conditions
  *         (setting possible with ADC enabled without conversion on going,
  *         ADC enabled with conversion on going, ...)
  *         Each feature can be updated afterwards with a unitary function
  *         and potentially with ADC in a different state than disabled,
  *         refer to description of each function for setting
  *         conditioned to ADC state.
  * @note   After using this function, other features must be configured
  *         using LL unitary functions.
  *         The minimum configuration remaining to be done is:
  *          - Set ADC group injected sequencer:
  *            map channel on the selected sequencer rank.
  *            Refer to function @ref LL_ADC_INJ_SetSequencerRanks().
  *          - Set ADC channel sampling time
  *            Refer to function LL_ADC_SetChannelSamplingTime();
  * @param  pADCx ADC instance
  * @param  pADC_InjInitStruct Pointer to a @ref LL_ADC_INJ_InitTypeDef structure
  * @retval An ErrorStatus enumeration value:
  *          - SUCCESS: ADC registers are initialized
  *          - ERROR: ADC registers are not initialized
  */
ErrorStatus LL_ADC_INJ_Init(ADC_TypeDef *pADCx, LL_ADC_INJ_InitTypeDef *pADC_InjInitStruct)
{
  ErrorStatus status = SUCCESS;

  /* Check the parameters */
  assert_param(IS_ADC_ALL_INSTANCE(pADCx));
  assert_param(IS_LL_ADC_INJ_TRIG_SOURCE(pADC_InjInitStruct->TriggerSource));
  assert_param(IS_LL_ADC_INJ_SEQ_SCAN_LENGTH(pADC_InjInitStruct->SequencerLength));
  if (pADC_InjInitStruct->SequencerLength != LL_ADC_INJ_SEQ_SCAN_DISABLE)
  {
    assert_param(IS_LL_ADC_INJ_SEQ_SCAN_DISCONT_MODE(pADC_InjInitStruct->SequencerDiscont));
  }
  assert_param(IS_LL_ADC_INJ_TRIG_AUTO(pADC_InjInitStruct->TrigAuto));

